CREATE TABLE IF NOT EXISTS groups (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    number INTEGER NOT NULL UNIQUE,
    major TEXT NOT NULL,
    graduation_year INTEGER NOT NULL
);

CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    group_id INTEGER NOT NULL,
    first_name TEXT NOT NULL,
    last_name TEXT NOT NULL,
    gender TEXT CHECK(gender IN ('М', 'Ж')),
    birth_date TEXT NOT NULL,
    student_id TEXT NOT NULL UNIQUE,
    FOREIGN KEY (group_id) REFERENCES groups(id)
);

INSERT OR IGNORE INTO groups (number, major, graduation_year) VALUES
(3051, 'Программная инженерия 1', 2025),
(3052, 'Программная инженерия 2', 2025);


INSERT OR IGNORE INTO students (group_id, first_name, last_name, gender, birth_date, student_id) VALUES
    (1, 'Роман', 'Зубков', 'М', '16.12.2005', '000098770'),
    (1, 'Максим', 'Иванов', 'М', '13.07.2005', '000099967'),
    (1, 'Артем', 'Ивенин', 'М', '11.05.2005', '000100275'),
    (2, 'Иван', 'Казейкин', 'М', '02.01.2005', '000096158'),
    (1, 'Артем', 'кочнев', 'М', '27.07.2005', '000096917'),
    (1, 'Илья', 'Логунов', 'М', '14.11.2005', '000096940'),
    (1, 'Юлия', 'Макарова', 'Ж', '17.10.2005', '000096527'),
    (2, 'Сергей', 'Маклаков', 'М', '17.01.2005', '000099515'),
    (1, 'Наталия', 'Маскинскова', 'Ж', '14.12.2005', '000100224'),
    (1, 'Дмитрий', 'Мукасеев', 'М', '28.07.2005', '000097089'),
    (1, 'Владислав', 'Наумкин', 'М', '27.09.2005', '000099292'),
    (2, 'Василий', 'Паркаев', 'М', '31.01.2006', '000098067'),
    (2, 'Дмитрий', 'Полковников', 'М', '26.01.2006', '000096761'),
    (2, 'Дмитрий', 'Пузаков', 'М', '07.04.2005', '000100239'),
    (2, 'Полина', 'Пшеницына', 'Ж', '30.07.2005', '000099694'),
    (2, 'Игорь', 'Пяткин', 'М', '19.10.2005', '000098931'),
    (1, 'Евгений', 'Рыбаков', 'М', '04.11.2004', '000096791'),
    (2, 'Владислав', 'Рыжкин', 'М', '27.08.2005', '000096747'),
    (1, 'Александра', 'Рябченко', 'Ж', '22.09.2005', '000100758'),
    (1, 'Илья', 'Томилин', 'М', '18.07.2004', '000087957'),
    (2, 'Илья', 'Тульсков', 'М', '01.11.2005', '000099785'),
    (2, 'Артем', 'Фирстов', 'М', '02.06.2005', '000100815'),
    (2, 'Владислав', 'Четайкин', 'М', '15.11.2005', '000103535'),
    (2, 'Максим', 'Шарунов', 'М', '29.06.2005', '000097456'),
    (1, 'Денис', 'Шушев', 'М', '16.06.2005', '000101046');













